Reports/ОтчетПоКонтрагенту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>ОтчетПоКонтрагенту</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>11</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ОтчетПоКонтрагенту/Ext/ObjectModule.bsl
Перем ОтборДатаС;
Перем ОтборДатаПо;

Процедура ЗаполнитьНачальныеНастройки() Экспорт

	ПостроительОтчета.Текст = "
	|ВЫБРАТЬ
	|	Документы.Ссылка КАК Документ,
	|	Документы.Ссылка.Представление КАК ДокументПредставление,
	|	Документы.СуммаПрих КАК СуммаПрих,
	|	Документы.СуммаРасх КАК СуммаРасх,
	|	Документы.Ссылка.Контрагент КАК Контрагент
	|ИЗ
	|	(
	|	ВЫБРАТЬ
	|		РасходнаяНакладнаяСостав.Ссылка КАК Ссылка,
	|		Сумма(РасходнаяНакладнаяСостав.Сумма) КАК СуммаРасх,
	|		0 КАК СуммаПрих
	|	ИЗ
	|		Документ.РасходнаяНакладная.Состав КАК РасходнаяНакладнаяСостав
	|		
	|	ГДЕ
	|		РасходнаяНакладнаяСостав.Ссылка.Контрагент = &ВыбКонтрагент
	|		{ГДЕ РасходнаяНакладнаяСостав.Ссылка.Дата КАК Дата}
	|
	|	СГРУППИРОВАТЬ ПО
	|		РасходнаяНакладнаяСостав.Ссылка
	|		
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ПриходнаяНакладнаяСостав.Ссылка,
	|		0,
	|		Сумма(ПриходнаяНакладнаяСостав.Сумма)
	|	ИЗ
	|		Документ.ПриходнаяНакладная.Состав КАК ПриходнаяНакладнаяСостав
	|	
	|	ГДЕ
	|		ПриходнаяНакладнаяСостав.Ссылка.Контрагент = &ВыбКонтрагент
	|		{ГДЕ ПриходнаяНакладнаяСостав.Ссылка.Дата КАК Дата}
	|
	|	СГРУППИРОВАТЬ ПО
	|		ПриходнаяНакладнаяСостав.Ссылка
	|		
	|	) КАК Документы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документы.Ссылка.Дата ВОЗР
	|	
	|ИТОГИ СУММА(СуммаРасх),СУММА(СуммаПрих) ПО
	|	Общие
	|";
	
	ПостроительОтчета.РазмещениеИзмеренийВСтроках  = ТипРазмещенияИзмерений.Вместе;
	ПостроительОтчета.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.ВместеСИзмерениями;
	ПостроительОтчета.ВыводитьДетальныеЗаписи = Истина;
	ПостроительОтчета.Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	ПостроительОтчета.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	ОтборДатаС = ПостроительОтчета.Отбор.Добавить("Дата");
	ОтборДатаС.ВидСравнения = ВидСравнения.БольшеИлиРавно;
	ОтборДатаПо = ПостроительОтчета.Отбор.Добавить("Дата");
	ОтборДатаПо.ВидСравнения = ВидСравнения.МеньшеИлиРавно;

КонецПроцедуры

Процедура СформироватьОтчет(Таб) Экспорт

	Таб.Очистить();
	
	ОтборДатаС.Значение = ДатаНачала;
	ОтборДатаС.Использование = ДатаНачала <> '00010101000000';
	ОтборДатаПо.Значение = КонецДня(ДатаОкончания);
	ОтборДатаПо.Использование = ДатаОкончания <> '00010101000000';

	ПостроительОтчета.Параметры.Вставить("ВыбКонтрагент", ВыбКонтрагент);
	
	Если ВыбКонтрагент.Пустая() Тогда
		ПостроительОтчета.Макет.Параметры.ШапкаОтчета = "Документы по контрагенту <...>";
	Иначе
		ПостроительОтчета.Макет.Параметры.ШапкаОтчета = "Документы по контрагенту """ + СокрЛП(ВыбКонтрагент) + """";
	КонецЕсли;
	
	ПостроительОтчета.Макет.Параметры.ШапкаОтчета = ПостроительОтчета.Макет.Параметры.ШапкаОтчета + " с " + ?(ДатаНачала = '00010101', "<...>", Формат(ДатаНачала, "ДФ=dd.MM.yyyy")) + " по " + ?(ДатаОкончания = '00010101', "<...>", Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"));
	
	ПостроительОтчета.Выполнить();
	ПостроительОтчета.Вывести(Таб);
	
	Таб.ТолькоПросмотр = Истина;

КонецПроцедуры
